---
kind: property
id: P:Autodesk.Revit.DB.KeyBasedTreeEntryError.ErrorType
source: html/f95a3294-8d76-fd99-1449-e544b9be8521.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntryError.ErrorType Property

Indicates which of possible types of problems with loading and/or building
 a KeyBasedTreeEntries that this KeyBasedTreeEntryError represents.

## Syntax (C#)
```csharp
public KeyBasedTreeEntryErrorType ErrorType { get; }
```